# Roughness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalProperties..::..Roughness Property
ThermalProperties Class See Also
---
Value of roughness.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int Roughness { get; set; }
```

Visual Basic
---
```text
Public Property Roughness As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Roughness {
	int get ();
	void set (int value);
}
```

# See Also
ThermalProperties Class
Autodesk.Revit.DB Namespace